@extends('layouts.index')

@section('title')Инструкция@endsection

@section('content')
    <h3 class="text-center mb-3 mt-3">Инструкция</h3>
    <ol>
        <li>Все действия доступны только после входа в приложение.</li>
        <li>Для просмотра платежей нажмите вкладку "Мои платежи".</li>
        <li>Для добавления нового платежа нажмите кнопку "Добавить" под таблицей. Заполните поля в форме.
        Нажмите кнопку "Сохранить".</li>
        <li>Для удаления или редактирования платежа нажмите соответсвующую кнопку рядом
            с необходимым платежом в таблице.</li>
        <li>Для редактирования платежа замените данные в форме на необходимые. Нажмите кнопку
            "Редактировать".</li>
        <li>При удалении платежа запрашивается подтверждение действия. После удаления восстановление
            данных не возможно.</li>
        <li>Для добавления, редактирования, удаления лимита действия выполняются по аналогии с платежами.</li>
        <li>Для просмотра баланса нажмите вкладку "Баланс". В открывшейся вкладке выведутся суммы расходов,
        доходов и баланс за все время. Баланс определяется как разность между доходами и расходами.</li>
        <li>Для просмотра баланса за определенный месяц выберете в выпадающем календаре необходимый месяц и год,
        нажмите кнопку выбрать.</li>
        <li>При превышении расходов над доходами и при выходе расходов за установленный лимит выводятся
            соответсвующие сообщения.</li>
        <li>За нарушение правил пользования программы (ввод бессмысленной информации, нецензурная лексика,
            распространение вредосноного ПО, попытки взлома программы, чужих аккаунтов и т.п.) пользователь
            может быть заблокирован администратором.</li>
        <li>При блокировке пользователю выводится соответсвующее сообщение.</li>
        <li>Заблокированные пользователи не могут добавлять, изменять, редактировать платежи и лимиты,
            но заблокированным пользователям доступен просмотр ранее введенных данных.</li>
        <li>Блокировка может быть снята при устранении ее причин. Решение о снятии блокировки принимает
            администратор.</li>
        <li>При установке блокировки повторно, ее снятие не производится, аккаунт блокируется навсегда.</li>
    </ol>
@endsection
